spec/support/vcr_cassettes/preneeds/military_ranks/gets_a_list_of_military_ranks.yml

---
http_interactions:
- request:
    method: post
    uri: "<PRENEEDS_HOST>/eoas_SOA/PreNeedApplicationPort"
    body:
      encoding: UTF-8
      string: <?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns="http://service.soa.eoas.cem.va.gov/"
        xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"><env:Body><tns:getMilitaryRankForBranchOfService><branchOfService>AC</branchOfService><startDate>1926-07-02</startDate><endDate>1926-07-02</endDate></tns:getMilitaryRankForBranchOfService></env:Body></env:Envelope>
    headers:
      Accept:
      - text/xml;charset=UTF-8
      Content-Type:
      - text/xml;charset=UTF-8
      User-Agent:
      - Vets.gov Agent
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Tue, 20 Jun 2017 17:14:27 GMT
      Transfer-Encoding:
      - chunked
      Content-Type:
      - multipart/related;start="<rootpart*87c3dc03-074f-4c67-8397-754e59ff4f57@example.jaxws.sun.com>";type="application/xop+xml";boundary="uuid:87c3dc03-074f-4c67-8397-754e59ff4f57";start-info="text/xml"
    body:
      encoding: UTF-8
      string: "--uuid:87c3dc03-074f-4c67-8397-754e59ff4f57\r\nContent-Id: <rootpart*87c3dc03-074f-4c67-8397-754e59ff4f57@example.jaxws.sun.com>\r\nContent-Type:
        application/xop+xml;charset=utf-8;type=\"text/xml\"\r\nContent-Transfer-Encoding:
        binary\r\n\r\n<?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:S=\"http://schemas.xmlsoap.org/soap/envelope/\"><S:Body><ns2:getMilitaryRankForBranchOfServiceResponse
        xmlns:ns2=\"http://service.soa.eoas.cem.va.gov/\"><return><activatedOneDate>1926-07-02T00:00:00-04:00</activatedOneDate><branchOfServiceCd>AC</branchOfServiceCd><deactivatedOneDate>1941-06-20T00:00:00-04:00</deactivatedOneDate><id><branchOfServiceCode>AC</branchOfServiceCode><rankCode>1ST
        LT</rankCode><rankDescr>FIRST LIEUTENANT</rankDescr></id></return><return><activatedOneDate>1926-07-02T00:00:00-04:00</activatedOneDate><branchOfServiceCd>AC</branchOfServiceCd><deactivatedOneDate>1941-06-20T00:00:00-04:00</deactivatedOneDate><id><branchOfServiceCode>AC</branchOfServiceCode><rankCode>1ST
        SGT</rankCode><rankDescr>FIRST SERGEANT</rankDescr></id></return><return><activatedOneDate>1926-07-02T00:00:00-04:00</activatedOneDate><branchOfServiceCd>AC</branchOfServiceCd><deactivatedOneDate>1941-06-20T00:00:00-04:00</deactivatedOneDate><id><branchOfServiceCode>AC</branchOfServiceCode><rankCode>2ND
        LT</rankCode><rankDescr>SECOND LIEUTENANT</rankDescr></id></return><return><activatedOneDate>1926-07-02T00:00:00-04:00</activatedOneDate><branchOfServiceCd>AC</branchOfServiceCd><deactivatedOneDate>1941-06-20T00:00:00-04:00</deactivatedOneDate><id><branchOfServiceCode>AC</branchOfServiceCode><rankCode>AVN
        CADET</rankCode><rankDescr>AVIATION CADET</rankDescr></id></return><return><activatedOneDate>1926-07-02T00:00:00-04:00</activatedOneDate><branchOfServiceCd>AC</branchOfServiceCd><deactivatedOneDate>1941-06-20T00:00:00-04:00</deactivatedOneDate><id><branchOfServiceCode>AC</branchOfServiceCode><rankCode>BRIG
        GEN</rankCode><rankDescr>BRIGADIER GENERAL</rankDescr></id></return><return><activatedOneDate>1926-07-02T00:00:00-04:00</activatedOneDate><branchOfServiceCd>AC</branchOfServiceCd><deactivatedOneDate>1941-06-20T00:00:00-04:00</deactivatedOneDate><id><branchOfServiceCode>AC</branchOfServiceCode><rankCode>CAPT</rankCode><rankDescr>CAPTAIN</rankDescr></id></return><return><activatedOneDate>1926-07-02T00:00:00-04:00</activatedOneDate><branchOfServiceCd>AC</branchOfServiceCd><deactivatedOneDate>1941-06-20T00:00:00-04:00</deactivatedOneDate><id><branchOfServiceCode>AC</branchOfServiceCode><rankCode>COL</rankCode><rankDescr>COLONEL</rankDescr></id></return><return><activatedOneDate>1926-07-02T00:00:00-04:00</activatedOneDate><branchOfServiceCd>AC</branchOfServiceCd><deactivatedOneDate>1941-06-20T00:00:00-04:00</deactivatedOneDate><id><branchOfServiceCode>AC</branchOfServiceCode><rankCode>CPL</rankCode><rankDescr>CORPORAL</rankDescr></id></return><return><activatedOneDate>1926-07-02T00:00:00-04:00</activatedOneDate><branchOfServiceCd>AC</branchOfServiceCd><deactivatedOneDate>1941-06-20T00:00:00-04:00</deactivatedOneDate><id><branchOfServiceCode>AC</branchOfServiceCode><rankCode>CWO2</rankCode><rankDescr>CHIEF
        WARRANT OFFICER 2ND CLASS</rankDescr></id></return><return><activatedOneDate>1926-07-02T00:00:00-04:00</activatedOneDate><branchOfServiceCd>AC</branchOfServiceCd><deactivatedOneDate>1941-06-20T00:00:00-04:00</deactivatedOneDate><id><branchOfServiceCode>AC</branchOfServiceCode><rankCode>CWO3</rankCode><rankDescr>CHIEF
        WARRANT OFFICER</rankDescr></id></return><return><activatedOneDate>1926-07-02T00:00:00-04:00</activatedOneDate><branchOfServiceCd>AC</branchOfServiceCd><deactivatedOneDate>1941-06-20T00:00:00-04:00</deactivatedOneDate><id><branchOfServiceCode>AC</branchOfServiceCode><rankCode>CWO4</rankCode><rankDescr>CHIEF
        WARRANT OFFICER</rankDescr></id></return><return><activatedOneDate>1926-07-02T00:00:00-04:00</activatedOneDate><branchOfServiceCd>AC</branchOfServiceCd><deactivatedOneDate>1941-06-20T00:00:00-04:00</deactivatedOneDate><id><branchOfServiceCode>AC</branchOfServiceCode><rankCode>FLT
        O</rankCode><rankDescr>FLIGHT OFFICER</rankDescr></id></return><return><activatedOneDate>1926-07-02T00:00:00-04:00</activatedOneDate><branchOfServiceCd>AC</branchOfServiceCd><deactivatedOneDate>1941-06-20T00:00:00-04:00</deactivatedOneDate><id><branchOfServiceCode>AC</branchOfServiceCode><rankCode>FLYING
        CADET</rankCode><rankDescr>FLYING CADET</rankDescr></id></return><return><activatedOneDate>1926-07-02T00:00:00-04:00</activatedOneDate><branchOfServiceCd>AC</branchOfServiceCd><deactivatedOneDate>1941-06-20T00:00:00-04:00</deactivatedOneDate><id><branchOfServiceCode>AC</branchOfServiceCode><rankCode>GA</rankCode><rankDescr>GENERAL
        OF THE ARMY</rankDescr></id></return><return><activatedOneDate>1926-07-02T00:00:00-04:00</activatedOneDate><branchOfServiceCd>AC</branchOfServiceCd><deactivatedOneDate>1941-06-20T00:00:00-04:00</deactivatedOneDate><id><branchOfServiceCode>AC</branchOfServiceCode><rankCode>GEN</rankCode><rankDescr>GENERAL</rankDescr></id></return><return><activatedOneDate>1926-07-02T00:00:00-04:00</activatedOneDate><branchOfServiceCd>AC</branchOfServiceCd><deactivatedOneDate>1941-06-20T00:00:00-04:00</deactivatedOneDate><id><branchOfServiceCode>AC</branchOfServiceCode><rankCode>LT
        COL</rankCode><rankDescr>LIEUTENANT COLONEL</rankDescr></id></return><return><activatedOneDate>1926-07-02T00:00:00-04:00</activatedOneDate><branchOfServiceCd>AC</branchOfServiceCd><deactivatedOneDate>1941-06-20T00:00:00-04:00</deactivatedOneDate><id><branchOfServiceCode>AC</branchOfServiceCode><rankCode>LT
        GEN</rankCode><rankDescr>LIEUTENANT GENERAL</rankDescr></id></return><return><activatedOneDate>1926-07-02T00:00:00-04:00</activatedOneDate><branchOfServiceCd>AC</branchOfServiceCd><deactivatedOneDate>1941-06-20T00:00:00-04:00</deactivatedOneDate><id><branchOfServiceCode>AC</branchOfServiceCode><rankCode>M
        SGT</rankCode><rankDescr>MASTER SERGEANT</rankDescr></id></return><return><activatedOneDate>1926-07-02T00:00:00-04:00</activatedOneDate><branchOfServiceCd>AC</branchOfServiceCd><deactivatedOneDate>1941-06-20T00:00:00-04:00</deactivatedOneDate><id><branchOfServiceCode>AC</branchOfServiceCode><rankCode>MAJ</rankCode><rankDescr>MAJOR</rankDescr></id></return><return><activatedOneDate>1926-07-02T00:00:00-04:00</activatedOneDate><branchOfServiceCd>AC</branchOfServiceCd><deactivatedOneDate>1941-06-20T00:00:00-04:00</deactivatedOneDate><id><branchOfServiceCode>AC</branchOfServiceCode><rankCode>MAJ
        GEN</rankCode><rankDescr>MAJOR GENERAL</rankDescr></id></return><return><activatedOneDate>1926-07-02T00:00:00-04:00</activatedOneDate><branchOfServiceCd>AC</branchOfServiceCd><deactivatedOneDate>1941-06-20T00:00:00-04:00</deactivatedOneDate><id><branchOfServiceCode>AC</branchOfServiceCode><rankCode>PFC</rankCode><rankDescr>PRIVATE
        FIRST CLASS</rankDescr></id></return><return><activatedOneDate>1926-07-02T00:00:00-04:00</activatedOneDate><branchOfServiceCd>AC</branchOfServiceCd><deactivatedOneDate>1941-06-20T00:00:00-04:00</deactivatedOneDate><id><branchOfServiceCode>AC</branchOfServiceCode><rankCode>PVT</rankCode><rankDescr>PRIVATE</rankDescr></id></return><return><activatedOneDate>1926-07-02T00:00:00-04:00</activatedOneDate><branchOfServiceCd>AC</branchOfServiceCd><deactivatedOneDate>1941-06-20T00:00:00-04:00</deactivatedOneDate><id><branchOfServiceCode>AC</branchOfServiceCode><rankCode>S
        SGT</rankCode><rankDescr>STAFF SERGEANT</rankDescr></id></return><return><activatedOneDate>1926-07-02T00:00:00-04:00</activatedOneDate><branchOfServiceCd>AC</branchOfServiceCd><deactivatedOneDate>1941-06-20T00:00:00-04:00</deactivatedOneDate><id><branchOfServiceCode>AC</branchOfServiceCode><rankCode>SGT</rankCode><rankDescr>SERGEANT</rankDescr></id></return><return><activatedOneDate>1926-07-02T00:00:00-04:00</activatedOneDate><branchOfServiceCd>AC</branchOfServiceCd><deactivatedOneDate>1941-06-20T00:00:00-04:00</deactivatedOneDate><id><branchOfServiceCode>AC</branchOfServiceCode><rankCode>SGT
        MAJ</rankCode><rankDescr>SERGEANT MAJOR</rankDescr></id></return><return><activatedOneDate>1926-07-02T00:00:00-04:00</activatedOneDate><branchOfServiceCd>AC</branchOfServiceCd><deactivatedOneDate>1941-06-20T00:00:00-04:00</deactivatedOneDate><id><branchOfServiceCode>AC</branchOfServiceCode><rankCode>T
        SGT</rankCode><rankDescr>TECHNICAL SERGEANT</rankDescr></id></return><return><activatedOneDate>1926-07-02T00:00:00-04:00</activatedOneDate><branchOfServiceCd>AC</branchOfServiceCd><deactivatedOneDate>1941-06-20T00:00:00-04:00</deactivatedOneDate><id><branchOfServiceCode>AC</branchOfServiceCode><rankCode>TEC
        3</rankCode><rankDescr>TECHNICAL 3</rankDescr></id></return><return><activatedOneDate>1926-07-02T00:00:00-04:00</activatedOneDate><branchOfServiceCd>AC</branchOfServiceCd><deactivatedOneDate>1941-06-20T00:00:00-04:00</deactivatedOneDate><id><branchOfServiceCode>AC</branchOfServiceCode><rankCode>TEC
        4</rankCode><rankDescr>TECHNICAL 4</rankDescr></id></return><return><activatedOneDate>1926-07-02T00:00:00-04:00</activatedOneDate><branchOfServiceCd>AC</branchOfServiceCd><deactivatedOneDate>1941-06-20T00:00:00-04:00</deactivatedOneDate><id><branchOfServiceCode>AC</branchOfServiceCode><rankCode>TEC
        5</rankCode><rankDescr>TECHNICAL 5</rankDescr></id></return><return><activatedOneDate>1926-07-02T00:00:00-04:00</activatedOneDate><branchOfServiceCd>AC</branchOfServiceCd><deactivatedOneDate>1941-06-20T00:00:00-04:00</deactivatedOneDate><id><branchOfServiceCode>AC</branchOfServiceCode><rankCode>WO</rankCode><rankDescr>WARRANT
        OFFICER</rankDescr></id></return><return><activatedOneDate>1926-07-02T00:00:00-04:00</activatedOneDate><branchOfServiceCd>AC</branchOfServiceCd><deactivatedOneDate>1941-06-20T00:00:00-04:00</deactivatedOneDate><id><branchOfServiceCode>AC</branchOfServiceCode><rankCode>WOJG</rankCode><rankDescr>WARRANT
        OFFICER JUNIOR GRADE</rankDescr></id></return></ns2:getMilitaryRankForBranchOfServiceResponse></S:Body></S:Envelope>\r\n--uuid:87c3dc03-074f-4c67-8397-754e59ff4f57--"
    http_version:
  recorded_at: Tue, 20 Jun 2017 17:14:27 GMT
recorded_with: VCR 3.0.3
